951001jli/IRSOH/ESP32CAM/esp32 cam/app_httpd.cpp
    int val = atoi(value);
    sensor_t * s = esp_camera_sensor_get();
    int res = 0;
    
    if(!strcmp(variable, "framesize")) 
    {
        Serial.println("framesize");
        if(s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val);
    }
    else if(!strcmp(variable, "quality")) 
    {
      Serial.println("quality");
      res = s->set_quality(s, val);
    }
    //Remote Control Car 
    //Don't use channel 1 and channel 2
    else if(!strcmp(variable, "flash")) 
    {
      ledcWrite(7,val);
    }  
    else if(!strcmp(variable, "speed")) 
    {
      if      (val > 255) val = 255;
      else if (val <   0) val = 0;       
      speed = val;
    }     
    else if(!strcmp(variable, "nostop")) 
    {
      noStop = val;
    }             
    else if(!strcmp(variable, "servo")) // 3250, 4875, 6500
    {
      if      (val > 650) val = 650; //650
      else if (val < 225) val = 325; //325      
      ledcWrite(8,10*val);
    }     
    else if(!strcmp(variable, "car")) {  
      if (val==1) {
        Serial.println("Forward");
        actstate = fwd;     
        ledcWrite(4,speed);  // pin 12
        ledcWrite(3,0);      // pin 13
        ledcWrite(5,speed);  // pin 14  
        ledcWrite(6,0);      // pin 15   
        delay(200);
      }
      else if (val==2) {   
        Serial.println("TurnLeft");
        ledcWrite(3,0);
        ledcWrite(5,0); 
        //if      (actstate == fwd) { ledcWrite(4,speed); ledcWrite(6,    0); }
        //else if (actstate == rev) { ledcWrite(4,    0); ledcWrite(6,speed); }
        //else                      { ledcWrite(4,speed); ledcWrite(6,speed); }
        ledcWrite(4,speed); 
        ledcWrite(6,speed);
              
        delay(100);  
        ledcWrite(4,0);
        ledcWrite(6,0);
      }
      else if (val==3) {
        Serial.println("Stop"); 
        actstate = stp;       
        ledcWrite(4,0);
        ledcWrite(3,0);
        ledcWrite(5,0);     
        ledcWrite(6,0);  
      }
      else if (val==4) {
        Serial.println("TurnRight");
        ledcWrite(4,0);
        ledcWrite(6,0); 
        //if      (actstate == fwd) { ledcWrite(3,    0); ledcWrite(5,speed); }
        //else if (actstate == rev) { ledcWrite(3,speed); ledcWrite(5,    0); }
        //else                      { ledcWrite(3,speed); ledcWrite(5,speed); }
        ledcWrite(3,speed); 
        ledcWrite(5,speed);
              
        delay(100);

        ledcWrite(3, 0);
        ledcWrite(5, 0);
        
      }
      else if (val==5) {
        Serial.println("Backward");  
        actstate = rev;      
        ledcWrite(4,0);
        ledcWrite(3,speed);
        ledcWrite(5,0);  
        ledcWrite(6,speed); 
        delay(200);              
      }
      if (noStop!=1) 
      {
        ledcWrite(3, 0);
        ledcWrite(4, 0);  
        ledcWrite(5, 0);  
        ledcWrite(6, 0);
      }         
    }        
    else 
    { 
      Serial.println("variable");
      res = -1; 
    }

    if(res){ return httpd_resp_send_500(req); }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
}

static esp_err_t status_handler(httpd_req_t *req){
    static char json_response[1024];

    sensor_t * s = esp_camera_sensor_get();
    char * p = json_response;
    *p++ = '{';

    p+=sprintf(p, "\"framesize\":%u,", s->status.framesize);
    p+=sprintf(p, "\"quality\":%u,", s->status.quality);
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!doctype html>
<html>
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width,initial-scale=1">
        <title>IRSOH</title>
        <style>
            * {
                padding: 0; 
                margin: 0;
                font-family: system-ui, sans-serif;
                
            }
            canvas {
                margin: auto;
                display: block;
            }
            .tITULO {
                text-align: center;
                color: rgb(81, 81, 81);
            }
            .LINK {
                color: red;
                width: 60px;
                margin: auto;
                display: block;
                font-size: 14px;
            }
            .cont_stream {
                width: 60%;
                max-width: 700px;
                border: 2px solid rgb(144, 194, 255);
                margin: auto;
                display: block;
            }
            .cont_flex {
                margin: 2px auto 2px;
                width: 35%;
                max-width: 130px;
                display: flex;
                flex-wrap: wrap;
                justify-content: space-around;
            }
            .cont_flex button {
                width: 37px;
                height: 37px;
                border: none;
                background-color: rgb(32, 148, 225);
                border-radius: 50%;
                color: white;
                font-size: 20px;
            }
            .cont_flex button:active {
                background-color: rgb(0, 100, 176);
            }
            input[type=range] {
                -webkit-appearance: none;
                width: 100%;
                height: 22px;
                background: #cecece;
                cursor: pointer;
                margin: 0;
                border-radius: 10px; /* Redondear los bordes */
            }
            input[type=range]:focus {
                outline: 0;
            }
            input[type=range]::-webkit-slider-runnable-track {
                width: 100%;
                height: 2px;
                cursor: pointer;
                background: #cecece;
                border-radius: 0;
                border: 0 solid #EFEFEF;
            }
            input[type=range]::-webkit-slider-thumb {
                border: 1px solid rgba(0, 0, 30, 0);
                height: 22px;
                width: 22px;
                border-radius: 50px;
                background: rgb(46, 140, 223);
                cursor: pointer;
                -webkit-appearance: none;
                margin-top: -10px;
            }
            .control-panel {
                display: grid;
                grid-template-columns: 1fr 1fr;
                gap: 4px;
                background-color: #fff;
                padding: 8px;
                border-radius: 20px;
                box-shadow: 0 4px 8px rgb(173, 173, 173);
                width: 50%;
                max-width: 600px;
                margin: auto;
            }
            .control-item {
                display: flex;
                flex-direction: column;
                align-items: center;
                background-color: #ededed;
                padding: 9px;
                border-radius: 20px;
            }
            .control-item label {
                margin-bottom: 3px;
            }

            body {
            background-color: #ececec; /* Color gris claro */
        }

        </style>

    </head>

    <body>

        <canvas id="canvas" width="200" height="65"></canvas>
        <h3 class="tITULO">IRSOH</h3>
       

      

