951001jli/IRSOH/ESP32CAM/esp32 cam/app_httpd.cpp
        <div class="close" id="close-stream" style="margin: auto"></div>     
        <img id="stream" src="" class="cont_stream">
        <br>
        <div class="cont_flex">     
            <button type="button" id="get-still">&#x2223;&#x2223;</button>
            <button type="button" id="toggle-stream">&#x25b6;</button>
        </div>
   <br>

        <div class="cont_flex">
            <div>
                <input type="checkbox" style="margin-right: 5px;" id="nostop" onclick="var noStop=0;if (this.checked) noStop=1;fetch(document.location.origin+'/control?var=nostop&val='+noStop);">Mantener
            </div>
        </div>

        <!--Direccion motores-->
        <div class="cont_flex">     
            <button type="button" id="forward" onclick="fetch(document.location.origin+'/control?var=car&val=1');">&#x2191;
 
            </button>
        </div>

        <div class="cont_flex">     
            <button type="button" id="turnleft" onclick="fetch(document.location.origin+'/control?var=car&val=4');">&#x2190;
 
            </button>
            <button type="button" id="stop" onclick="fetch(document.location.origin+'/control?var=car&val=3');">O
          
            </button>
            <button type="button" id="turnright" onclick="fetch(document.location.origin+'/control?var=car&val=2');">&#x2192;
   
            </button>  
        </div>

        <div class="cont_flex">     
            <button type="button" id="backward" onclick="fetch(document.location.origin+'/control?var=car&val=5');">&#x2193;
       
            </button>
        </div>

 
        <!--Cierre direccion-->

        <br>

        <div class="control-panel">  
            <div class="control-item">
                <label for="servo">Ángulo</label>
                <input type="range" id="servo" min="325" max="650" value="487" onchange="try{fetch(document.location.origin+'/control?var=servo&val='+this.value);}catch(e){}">
            </div>
            <div class="control-item">
                <label for="speed">Velocidad</label>
                <input type="range" id="speed" min="0" max="255" value="255" onchange="try{fetch(document.location.origin+'/control?var=speed&val='+this.value);}catch(e){}">
            </div>
            <div class="control-item">
                <label for="flash">Flash</label>
                <input type="range" id="flash" min="0" max="255" value="0" onchange="try{fetch(document.location.origin+'/control?var=flash&val='+this.value);}catch(e){}">
            </div>
            <div class="control-item">
                <label for="quality">Calidad</label>
                <input type="range" id="quality" min="10" max="63" value="10" onchange="try{fetch(document.location.origin+'/control?var=quality&val='+this.value);}catch(e){}">
            </div>
            <div class="control-item">
                <label for="framesize">Resolución</label>
                <input type="range" id="framesize" min="0" max="6" value="5" onchange="try{fetch(document.location.origin+'/control?var=framesize&val='+this.value);}catch(e){}">
            </div>
        </div>
    <br>    <br>


        




    <script>
        window.onload = function(){
            var canvas = document.getElementById("canvas");
            var ctx = canvas.getContext("2d");

            ctx.fillStyle = "rgb(34, 122, 255)";
            ctx.fillRect(73,25,60,35);
            ctx.clearRect(78,30,50,25);

            ctx.fillRect(93,20,20,5);
            ctx.fillRect(68,35,5,15);
            ctx.fillRect(133,35,5,15);

            ctx.beginPath();
            ctx.arc(92,42,6,0,2*Math.PI,true);
            ctx.fill();

            ctx.beginPath();
            ctx.arc(117,42,6,0,2*Math.PI,true);
            ctx.fill();

            ctx.clearRect(50,85,100,20);
        }

        document.addEventListener('DOMContentLoaded', function() {
            function sendControlRequest(element) {
                let value;
                switch (element.type) {
                    case 'checkbox':
                        value = element.checked ? 1 : 0;
                        break;
                    case 'range':
                    case 'select-one':
                        value = element.value;
                        break;
                    case 'button':
                    case 'submit':
                        value = '1';
                        break;
                    default:
                        return;
                }
                const url = `${baseUrl}/control?var=${element.id}&val=${value}`;
                fetch(url).then(response => {
                    console.log(`Request to ${url} finished, status: ${response.status}`);
                });
            }
            
            const baseUrl = document.location.origin;

            const hideElement = (element) => element.classList.add('hidden');
            const showElement = (element) => element.classList.remove('hidden');
            const disableElement = (element) => {
                element.classList.add('disabled');
                element.disabled = true;
            };
            const enableElement = (element) => {
                element.classList.remove('disabled');
                element.disabled = false;
            };
            const updateElement = (element, value, shouldSendRequest = true) => {
                let currentValue;
                if (element.type === 'checkbox') {
                    currentValue = element.checked;
                    value = !!value;
                    element.checked = value;
                } else {
                    currentValue = element.value;
                    element.value = value;
                }

                if (shouldSendRequest && currentValue !== value) {
                    sendControlRequest(element);
                } else {
                    if (element.id === 'aec') {
                        value ? hideElement(aecValueGroup) : showElement(aecValueGroup);
                    } else if (element.id === 'agc') {
                        value ? (showElement(agcGainGroup), hideElement(gainCeilingGroup)) : (hideElement(agcGainGroup), showElement(gainCeilingGroup));
                    } else if (element.id === 'awb_gain') {
                        value ? showElement(wbModeGroup) : hideElement(wbModeGroup);
                    } else if (element.id === 'face_recognize') {
                        value ? enableElement(faceEnrollButton) : disableElement(faceEnrollButton);
                    }
                }
            };

