951001jli/IRSOH/ESP32CAM/esp32 cam/app_httpd.cpp
            document.querySelectorAll('.close').forEach(button => {
                button.onclick = () => {
                    hideElement(button.parentNode);
                };
            });

            fetch(`${baseUrl}/status`).then(response => response.json()).then(data => {
                document.querySelectorAll('.default-action').forEach(element => {
                    updateElement(element, data[element.id], false);
                });
            });

            const stream = document.getElementById('stream');
            const streamContainer = document.getElementById('stream-container');
            const getStillButton = document.getElementById('get-still');
            const toggleStreamButton = document.getElementById('toggle-stream');
            const faceEnrollButton = document.getElementById('face_enroll');
            const closeStreamButton = document.getElementById('close-stream');

            const stopStream = () => {
                window.stop();
                toggleStreamButton.innerHTML = '&#x25b6;';
            };

            const startStream = () => {
                stream.src = `${baseUrl}:81/stream`;
                showElement(streamContainer);
                toggleStreamButton.innerHTML = '&#x2223;&#x2223;';
            };

            getStillButton.onclick = () => {
                const imgURL = `${baseUrl}/capture?_cb=${Date.now()}`;
                const link = document.createElement('a');
                link.href = imgURL;
                link.download = 'capture.jpg';
                document.body.appendChild(link);
                link.click();
                document.body.removeChild(link);
            };

            closeStreamButton.onclick = () => {
                stopStream();
                hideElement(streamContainer);
            };

            toggleStreamButton.onclick = () => {
                if (toggleStreamButton.innerHTML === 'Stop Stream') {
                    stopStream();
                } else {
                    startStream();
                }
            };

            faceEnrollButton.onclick = () => {
                sendControlRequest(faceEnrollButton);
            };

            document.querySelectorAll('.default-action').forEach(element => {
                element.onchange = () => sendControlRequest(element);
            });

            const agcCheckbox = document.getElementById('agc');
            const agcGainGroup = document.getElementById('agc_gain-group');
            const gainCeilingGroup = document.getElementById('gainceiling-group');
            agcCheckbox.onchange = () => {
                sendControlRequest(agcCheckbox);
                agcCheckbox.checked ? (showElement(gainCeilingGroup), hideElement(agcGainGroup)) : (hideElement(gainCeilingGroup), showElement(agcGainGroup));
            };

            const aecCheckbox = document.getElementById('aec');
            const aecValueGroup = document.getElementById('aec_value-group');
            aecCheckbox.onchange = () => {
                sendControlRequest(aecCheckbox);
                aecCheckbox.checked ? hideElement(aecValueGroup) : showElement(aecValueGroup);
            };

            const awbGainCheckbox = document.getElementById('awb_gain');
            const wbModeGroup = document.getElementById('wb_mode-group');
            awbGainCheckbox.onchange = () => {
                sendControlRequest(awbGainCheckbox);
                awbGainCheckbox.checked ? showElement(wbModeGroup) : hideElement(wbModeGroup);
            };

            const faceDetectCheckbox = document.getElementById('face_detect');
            const faceRecognizeCheckbox = document.getElementById('face_recognize');
            const frameSizeSelect = document.getElementById('framesize');
            frameSizeSelect.onchange = () => {
                sendControlRequest(frameSizeSelect);
                if (frameSizeSelect.value > 5) {
                    updateElement(faceDetectCheckbox, false);
                    updateElement(faceRecognizeCheckbox, false);
                }
            };

            faceDetectCheckbox.onchange = () => {
                if (frameSizeSelect.value > 5) {
                    updateElement(faceDetectCheckbox, false);
                } else {
                    updateElement(faceRecognizeCheckbox, faceDetectCheckbox.checked);
                }
            };

            faceRecognizeCheckbox.onchange = () => {
                if (frameSizeSelect.value > 5) {
                    updateElement(faceRecognizeCheckbox, false);
                } else {
                    updateElement(faceRecognizeCheckbox, faceDetectCheckbox.checked);
                }
            };
        });
    </script>
</body>
</html>


)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer()
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
